import React from "react";

function BlockTitle() {
  return (
    <div id="blocktitle">
      <div className="blocktitle">
        <div className="blocktitle__text1">
          <h3>
            <div></div>Какие существуют конфигурации для Spring Framework 5;
          </h3>
          <h3>
            <div></div>Как работать с REST-сервисами и документацией при помощи
            Swagger.
          </h3>
          <h3>
            <div></div>Что такое бины и как с ними работать;
          </h3>
          <h3>
            <div></div>Что такое Концепция IoC;
          </h3>
          <h3>
            <div></div>Примеры использования AOP;
          </h3>
        </div>
        <div className="blocktitle__text2">
          <p>
            Ищите способы ускорить проектирование приложений? Используйте Spring
            Framework 5. Этот <br /> легковесный каркас с открытыми исходными
            текстами не связан с конкретной моделью <br /> программирования и
            поэтому универсален. Его можно использовать не только для крупных{" "}
            <br />
            корпоративных кейсов, но и для небольших проектов.
          </p>
          <p>
            Интересно? Присоединяйтесь к нашему курсу и узнайте об основных
            модулях этого <br /> фреймворка, вариантах их использования и как
            Spring Framework работает совместно <br /> с другими технологиями.
          </p>
          <p>
            Если вы уже знакомы с Spring Framework 5 и хотите углубить свои
            знания, то этот курс для вас! Вместе с <br /> IBS Training Center вы
            изучите темы, необходимые для профессионального применения Spring
            <br />
            Framework на практике. Вы познакомитесь со Spring REST, HATEOAS и
            CORS, научитесь использовать <br /> сериализацию и ограничение
            данных, освоите тонкости применения аннотации @Transactional и
            <br />
            оптимистических транзакций.
          </p>
          <p>
            Также вас ждет много практики, разбор реальных кейсов и другие{" "}
            <br />
            важные темы:
          </p>
        </div>
        <div className="blocktitle__text3">
          <h3>
            <div></div>JWT-авторизация;
          </h3>
          <h3>
            <div></div>Практическое применение реактивного программирования с
            использованием WebFlux;
          </h3>
          <h3>
            <div></div>Тестирование Spring-сервисов
          </h3>
          <h3>
            <div></div>Планировщик задач и Actuator
          </h3>
        </div>
      </div>
    </div>
  );
}

export default BlockTitle;
